app/Helpers/helpers.php

    function tk1GetLogo()
    {
        $oLogo = Homepage::where('page_name', 'website')->first();
---
select * from `homepage` where `page_name` = 'website' limit 1

    function tk1GetFooterLogo()
    {
        $oLogo = Homepage::where('page_name', 'footer')->first();
---
select * from `homepage` where `page_name` = 'footer' limit 1

    function tk1GetMenu()
    {
        $oText = BlockInfo::where('block_type', 'menu_text')->get();
---
select * from `block_info` where `block_type` = 'menu_text'

    function tk1GetFooter()
    {
        $oText = BlockInfo::where('block_type', 'footer_text')->get();
---
select * from `block_info` where `block_type` = 'footer_text'