app/Http/Controllers/Web/ApartmentController.php

select * from `homepage` where `page_name` = 'thong-tin-can-ho' limit 1
select * from `block_info` where `block_type` = 'master_plan' limit 1
select * from `block_info` where `block_type` = 'floor6' limit 1
select * from `block_info` where `block_type` = 'rooftop'
select * from `block_info` where `block_type` = 'floorplanA'
select * from `block_info` where `block_type` = 'floorplanB'
select * from `block_info` where `block_type` = 'floorplanC'
select * from `block_info` where `block_type` = 'home_text'
---
    public function index()
    {
        $oPage = Homepage::where('page_name', 'thong-tin-can-ho')->first();
        $oMaster = BlockInfo::where('block_type', 'master_plan')->first();
        $oFloor6 = BlockInfo::where('block_type', 'floor6')->first();
        $oRoofs = BlockInfo::where('block_type', 'rooftop')->get();
        $oFloorA1 = BlockInfo::where('block_type', 'floorplanA')->get();
        $oFloorB1 = BlockInfo::where('block_type', 'floorplanB')->get();
        $oFloorC1 = BlockInfo::where('block_type', 'floorplanC')->get();
        $oText = BlockInfo::where('block_type', 'apartment_text')->get();