app/Http/Controllers/Web/HomeController.php

select * from `homepage` where `page_name` = 'trang-chu' limit 1
select * from `block_info` where `block_type` = 'home_text'
---
    public function index()
    {
        $oPage = Homepage::where('page_name', 'trang-chu')->first();
        $oSliders = BlockInfo::where('block_type', 'slider_home')->orderBy('order_id')->get();
        $oGalleries = BlockInfo::where('block_type', 'gallery_home')->orderBy('order_id')->get();
        $oPartners = BlockInfo::where('block_type', 'partner')->orderBy('order_id')->get();
        $oLocations = BlockInfo::where('block_type', 'location')->get();

select * from `block_info` where `block_name` = 'A12.01' limit 1
---
    public function getApartmentInfo()
    {
        $apartment = BlockInfo::where('block_name', $_POST['code'])->first();