app/Http/Controllers/Web/NewsController.php

    public function index()
    {
        $oPage = Homepage::where('page_name', 'tin-tuc')->first();
        $oNews = BlockInfo::where('block_type', 'news')->get();
---
select * from `homepage` where `page_name` = 'tin-tuc' limit 1
select * from `block_info` where `block_type` = 'news'

    public function detail($id)
    {
        $id = intval($id);

        $news = BlockInfo::where('id', $id)->first();
        $oNews = BlockInfo::where('block_type', 'news')->where('id', '<>', $id)->get()->take(3);
---
select * from `block_info` where `id` = 43 limit 1
select * from `block_info` where `block_type` = 'news' and `id` <> 43