app/Http/Controllers/Admin/BlockInfoController.php

    public function store(StoreBlockInfo $request)
    {
        // Sanitize input
        $sanitized = $request->getSanitized();
        $sanitized['block_type'] = $_GET['block_type'];


        // Store the BlockInfo
        $blockInfo = BlockInfo::create($sanitized);
---
insert into `block_info` (`head_tag1`, `head_title1`, `head_desc1`, `info1`, `block_name`, `block_type`, `info2`, `info3`, `info4`, `info5`, `block_date`, `updated_at`, `created_at`) values ('{\"vi\":null}', '{\"en\":\"Location\",\"vi\":\"Vi tri\"}', '{\"vi\":null}', '{\"vi\":null}', 'menu_location', 'menu_text', '', '', '', '', '', '2022-10-22 01:57:51', '2022-10-22 01:57:51')

    public function update(UpdateBlockInfo $request, BlockInfo $blockInfo)
    {
        // Sanitize input
        $sanitized = $request->getSanitized();
        $sanitized['block_type'] = $_GET['block_type'];

        //print_r($sanitized);exit;

        // Update changed values BlockInfo
        $blockInfo->update($sanitized);
---
update `block_info` set `block_name` = 'menu_home', `block_info`.`updated_at` = '2022-10-22 01:58:08' where `id` = 80